; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v2)
		(pred_5 ?v3)
		(pred_2 ?v8)
		(pred_1 ?v8)
		(pred_3 ?v3 ?v8)
		(pred_6)
		(pred_4 ?v3))

   (:action op_1
       :parameters  (?v1 ?v5)
       :precondition (and (not-eq ?v1 ?v5) 
                          (pred_2 ?v1) (pred_2 ?v5) (pred_1 ?v1))
       :effect (and  (pred_1 ?v5)
		     (not (pred_1 ?v1))))


   (:action op_3
       :parameters (?v6 ?v4)
       :precondition  (and  (pred_5 ?v6) (pred_2 ?v4)
			    (pred_3 ?v6 ?v4) (pred_1 ?v4) (pred_6))
       :effect (and (pred_4 ?v6)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_6))))

   (:action op_2
       :parameters  (?v6  ?v4)
       :precondition  (and  (pred_5 ?v6) (pred_2 ?v4)
			    (pred_4 ?v6) (pred_1 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_6)
		    (not (pred_4 ?v6)))))

; problem
(define (problem ferry-l5-c2)
(:domain ferry)
(:objects obj_03 obj_06 obj_04 obj_05 obj_02 
          obj_07 obj_01 
)
(:init
(pred_2 obj_03)
(pred_2 obj_06)
(pred_2 obj_04)
(pred_2 obj_05)
(pred_2 obj_02)
(pred_5 obj_07)
(pred_5 obj_01)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(pred_6)
(pred_3 obj_07 obj_04)
(pred_3 obj_01 obj_06)
(pred_1 obj_05)
)
(:goal
(and
(pred_3 obj_07 obj_02)
(pred_3 obj_01 obj_03)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_07 obj_02) (pred_1 obj_03))
    (sometime-before  (pred_3 obj_01 obj_03) (pred_1 obj_04))
  )
)
)

; plan
1. (op_1 obj_05 obj_04)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_04)
   goals met: 0 of 2
2. (op_3 obj_07 obj_04)
   deleted: (pred_3 obj_07 obj_04) (pred_6)
   added: (pred_4 obj_07)
   goals met: 0 of 2
3. (op_1 obj_04 obj_06)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_06)
   goals met: 0 of 2
4. (op_2 obj_07 obj_06)
   deleted: (pred_4 obj_07)
   added: (pred_3 obj_07 obj_06) (pred_6)
   goals met: 0 of 2
5. (op_3 obj_01 obj_06)
   deleted: (pred_3 obj_01 obj_06) (pred_6)
   added: (pred_4 obj_01)
   goals met: 0 of 2
6. (op_1 obj_06 obj_03)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_03)
   goals met: 0 of 2
7. (op_2 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_3 obj_01 obj_03) (pred_6)
   goals met: 1 of 2
8. (op_1 obj_03 obj_06)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_06)
   goals met: 1 of 2
9. (op_3 obj_07 obj_06)
   deleted: (pred_3 obj_07 obj_06) (pred_6)
   added: (pred_4 obj_07)
   goals met: 1 of 2
10. (op_1 obj_06 obj_02)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_02)
   goals met: 1 of 2
11. (op_2 obj_07 obj_02)
   deleted: (pred_4 obj_07)
   added: (pred_3 obj_07 obj_02) (pred_6)
   goals met: 2 of 2
